{
	"Архитектура и организација на компјутери": "Разбирање на главните компјутерски архитектури, внатрешната организација, проценка на перформансите на поедините делови и компјутерскиот систем во целинa.",
	"Бизнис и менаџмент": "Развој на менаџерски способности: техничка, концепциска, комуникациска, аналитичка.\nУсвојување на рамки, поими, модели и техники од областа на менаџментот.\nПрезентирање и анализа на примери, студии на случај и најдобри менаџмент практики од повеќе бизнис области и студии на случај на поодделни бизниси.",
	"Бизнис статистика": "Запознавање со основните статистички методи и техники за прикажување, анализа и истражување на податоци.",
	"Вовед во компјутерските науки": "Солидно познавање на основите на информатичко-комуникациските технологии, нивното создавање, моментална состојба и иднината; начинот на кој функционираат сметачите, основите на Веб, обработката на сликите, видеото и анимациите; клучните области на информациско-комуникациските технологии и нивното влијание: спососност за манипулација со текст, табели, графикони, слики, аудио и видео.",
	"Дизајн на дигитални кола": "Запознавање со основните методи за анализа и дизајн на логички кола и логички мрежи, како комбинациони така\nи секвенцијални кола, регистри и бројачи.",
	"Дискретна математика": "Курсот претставува вовед во основните математички концепти неопходни за повисоките курсеви од информациски технологии, компјутерско и софтверско инженерство.",
	"Дискретни структури 1": "Во овој предмет ќе се изучуваат базични математички концепти за компјутерски науки. Студентите ќе се запознаат со основите на множества, исказна и предикатна логика, техники за докажување и булова алгебра.",
	"Дискретни структури 2": "Курсот претставува вовед во основните математички концепти неопходни за повисоките курсеви од компјутерски науки. Ќе се изучуваат напредни техники за докажување, индукција рекурзија. Студентите треба да стекнат вештини за решавање на комбинаторни задачи. Да се запознаат со основната терминологија и основите за претставување на графови.",
	"Е-учење": "По успешното завршување на овој предмет, студентот ќе биде запознат со еволуцијата на теориите за учење и ќе биде во состојба да ги разбере улогата и новите трендови кај околините за е-учење како и да го разбере преминот од традиционалните во е-околините за учење. Низ примери за примена на видео игри, масивни отворени онлајн курсеви, оддалечени и виртуелни лаборатории, виртуелни училници студентите ќе се запознаат со можностите за искористување на ИКТ за поддршка на образованието. Студентите ќе се стекнат со способност да понудат соодветни постојни системи и алатки за менаџирање со учење и наставни содржини како и системи и алатки за проверка на знаење за дадени бизнис побарувања.",
	"Математика 1": "Предметот е од подршка и е неопходен за воведување на поимите за функција, лимес, извод и интеграли кои се неопходни во скоро сите предмети од повисоки години.",
	"Калкулус 1": "Предметот е од подршка и е неопходен за воведување на поимите за функција, лимес и извод кои се неопходни во скоро сите предмети од повисоки години.",
	"Калкулус 2": "Предметот е од подршка и е неопходен за воведување на поимите за интеграли, примена на интерграли, низи и редови кои се неопходни во дел од предметите од повисоки години.",
	"Компјутерски архитектури": "Разбирање на архитектурата на еден компјутерски систем, идентификација на неговите составни делови, проценка на перформансите на компјутерскиот систем и неговите поединечни делови. Разбирање на машинскиот јазик, асемблерот и мемориската организација на системите.",
	"Компјутерски компоненти": "Познавање на структурата на компјутерските системи, хардверските компоненти, поврзувањето и начинот на\nработа, карактеристиките и стандардите што се употребуваат.",
	"Креативни вештини за решавање проблеми": "Студентот ќе се здобие со способност за критичко размислување и развој на вештините на размислување надвор од стандардните норми и принципи. Ќе биде во можност да го постави проблемот во рамка и да го изложи правилно, како и да решава неструктурирани проблеми. Ќе има подобрени вештини за општо решавање на проблеми од различен карактер кои стимулираат логичко размислување.",
	"Маркетинг": "Вовед во главните елементи за развој на маркетинг стратегија и планирање на програма за маркетинг; Развој на вештини за решавање на маркетинг проблеми преку аналитички алатки (рамки, поими, модели и техники); Анализа на примери и студии на случај како претпријатијата го организираат својот маркетинг, со акцент на ИКТ претпријатија; Подобрување на комуникациските вештини, усни и писмени, работа во тим при изработка на проектна задача, презентирање на проектната задача.",
	"Објектно ориентирана анализа и дизајн": "Запознавање со техниките за анализа, дизајн и моделирање на објектно ориентираните системи. Оспособување за практична анализа на кориснички барања и креирање ефективни ОО модели како почетна фаза на имплементацијата на ОО системот.",
	"Објектно-ориентирано програмирање": "Целта на предметот е да го запознае студентот со основните концепти на објектно-ориентираното програмирање. За таа цел ќе бидат воведени концептите на објекти и класи, eнкапсулација, наследување и полиморфизам. Студентите ќе бидат запознаени и со хиерахијата на класи. Ќе се направат споредби на имплементациите на објектно-ориентираните концепти во различни програмски јазици.\nПо завршување на курсот студентот ќе ги разбира принципите на објектно-ориентираното програмирање и биде оспособен за развој на програми кои ги подржуваат овие принципи.",
	"Основи на Веб дизајн": "По комплетирање на курсот кандидатите се очекува студентите да добијат воведни знаењаза развој на веб страници со современ дизајн, употреба на ХТМЛ и каскадни стилови. Се очекува кандидатите да:\n1. Демонстрираат основно разбирање на важноста на добар дизајн на веб страниците.\n2. Демонстрираат практично знаење за технологиите за веб дизајн и да можат да го применат знаењето при основно дизајнирање на веб сајтови.\n3. Да комуницираат со терминологија специфична за оваа област.\n4. Критички да евалуираат примери на веб сајтови.",
	"Основи на сајбер безбедноста": "Студентот ќе се запознае со концептот на сајбер безбедност, закани и ризици. Ќе биде свесен за проблемите предизвикани од сајбер криминалот и ќе биде во можност да ги разбира ризиците од напади и основните механизми како да се заштити од нив.",
	"Педагогија": "Запознавање на студентите со педагогијата како наука, педагошките дисциплини, воспитанието и училишниот систем.",
	"Професионални вештини": "Целта на курсот е да студентите да се стекнат со вештини потребни за академско и техничко пишување и презентирање, со водење сметка за етиката и критичкото мислење. По завршување на курсот се очекува студентот да може да изработи квалитетни академски текстови (резиме, есеј, CV, формално писмо) на англиски и македонски јазик; да разликува помеѓу различни технички текстови (спецификација, елаборат, извештај, техничка документација) и да идентификува нивни делови; да одржи ефективна презентација на зададена тема и да одговори на прашања поврзани со презентацијата;",
	"Структурно програмирање": "Да се воведат студентите во парадигмата на структурното програмирање, да го разберат концептот на алгоритми и да се оспособат да развиваат алгоритми, да кодират, тестираат и компајлираат програми. Студентите ќе можат да пишуваат програми за решавање проблеми преку користење на податочни типови, контролни структури, функции, низи во програмскиот јазик C++.",
	"Физика": "Студентите ќе се запознаат со основните физички величини и закони од класичната механика. Тие ќе се стекнат со основни вештини за експериментална работа, како и за пресметување и правилно толкување на добиените резултати од областите кои се дел од содржината. Теоретските знаења на студентите ќе бидат солидна подлога за понатамошна надградба која е потребна за разбирање и моделирање на различните процеси каде што се применуваат информатиката и компјутерското инженерство.",
	"Алгоритми и податочни структури": "Запознавање со основните податочни структури и алгоритми кои се понатаму неопходни за работа со бази на\nподатоци како и за други апликации. Студентот ќе биде оспособен за користење и развој на структури и алгоритми\nсо линеарни листи, стебла, графови како и и индекси за пребарување. Исто така ќе биде оспособен за\nимплемнтација на различните архетипи на алгоритми што се користат во практичната имплементација на многу\nсофтверски решенија.",
	"Анализа на софтверските барања": "По завршувањето на предметот се очекува студентот да ги разбира и има продлабочено знаење во примена на техниките за извлекување знаење од клиентот, да ги разбира техниките за документирање на софтверски и бизнис потреби, да ги разбира и има продлабочено знаење во примената на техники за управување со промени кај софтверски и бизнис барања.",
	"Безжични и мобилни системи": "Познавање и разбирање на системите за безжична и мобилна комуникација",
	"Веројатност и статистика": "Да се воведат основните концепти од веројатност и статистичка анализа со дискусија на примените во компјутерските науки. Да се оспособат студентите за успешно следење на стручните предмети во кои се применуваат елементи од теорија на веројатност и статистика.",
	"Вештачка интелигенција": "Успешниот студент ќе има продлабочени познавања од основните области на вештачката интелигенција, вклучувајќи ги: пребарувањето, решавањето проблеми, претставувањето на знаењето, расудувањето, донесувањето одлуки, планирањето и учењето и нивната примена. Исто така, ќе биде во состојба да ги дизајнира и реализира клучните проблеми од интелигентните системи со средна сложеност и да го процени нивното однесување.",
	"Визуелно програмирање": "Со завршување на овој курс се очекува студентите да се запознаени со техниките за развивање на софтвер во\nнапредна интегрирана развојна околина користејќи модерен објектно-ориентиран програмски јазик, дизајнирање\nна богати графички кориснички интерфејси и откривање и отстранување на грешки во истата. Се очекува\nстудентите да бидат оспособени за развој на настански водени апликации, развој на графички кориснички\nинтерфејси, напредни форми за внесување на податоци, асинхроно програмирање, кориснички дефинирани контроли и креирање на инсталациски пакети.",
	"Вовед во екоинформатиката": "Екоинформатиката е наука за информации (информатика) во екологијата и науката за животната средина. Ги интегрира еколошките и информатичките науки за да ги дефинира ентитетите и природните процеси со јазик заеднички за луѓето и за компјутерите. Екоинформатиката има за цел да го олесни истражувањето и управувањето со животната средина преку развивање начини за пристап, интегрирање на знаење од различни извори на информации за животната средина и развивање на нови алгоритми кои овозможуваат комбинирање на различни информации за животната средина за да се тестираат еколошките хипотези.",
	"Вовед во случајни процеси": "Да се оспособат студентите да моделираат случајни процеси за реални ситуации.",
	"Дигитално процесирање на слика": "По завршување на курсот се очекува студентот да ги владее и користи основните алатки и методи за обработка на слики.",
	"Дигитизација": "Целта на предметот е да се научат процесот и техниките за дигитизација. Студентите треба да ги совладаат основните принципи за менаџирање со дигитални материјали и нивна презервација, како и техники и технологии за нивно презентрање.",
	"Дизајн на алгоритми": "Во овој курс ќе се научат повеќе алгоритми и методи за решавање на проблемите со компјутер, како и одредени структури на податоци за имплементација на истите. Студентот ќе стекне искуство од програмирање, ќе ги разбере  принципите на дизајнирање на алгоритми, анализа на перформансите на алгоритмите и ќе ги научи фундаменталните идеи за дизајн на ефикасен алгоритам и комбинирање на истиот со соодветна структура на податоци. Идеите ќе се применат во пракса преку лабораториск вежби.",
	"Е-влада": "Целта на курсот е студентите да се запознаат со испораката на услугите од страна на владините институции кон корисниците: граѓаните, бизнисите и организациите од невладиниот сектор и примената на информациските технологии во тие процеси; да се запознаат со напредните држави и напредните области на примена на е-влада преку анализа на примери, студии на случај и најдобри практики; Подобрување на комуникациските вештини, усни и писмени, работа во тим при изработка на проектна задача, презентирање на проектната задача.",
	"Економија за ИКТ инженери": "ИКТ инженерите, изработувајќи и нудејќи ИКТ услуги, се соочуваат со прашања во врска со SLA договорите, продавачите, добавувачите, со финансиските аспекти на ИКТ услугите – колку чини услугата, зошто токму толку, колкави се трошоците, колку е дозволено да бидат трошоците и слично. Области кои им е потребно да ги владеат се буџетирање, книговодство, определување на цени, финансиско планирање, финансиска анализа и известување. Овој курс има за задача да им овозможи да ги совладаат овие области преку опис на основните  економски модели; демонстрирање како овие модели работат; опис на главните економски феномени со користење економски модели.",
	"Електрични кола": "Запознавање со основните поими и појави од електричните кола, со основните закони и теореми во теоријата на електричните кола и со некои методи за анализа на електрични мрежи со временски констатни и временски прпоменливи струи и напони. Користење на основните законитости во електротехниката при решавање на конкретни проблеми во инженерството.",
	"Информатичко размислување во образованието": "Во 21 век, информатичкото размислување е вештина од клучно значење за сите граѓани на светот. Информатиката и технологијата влијаат на целиот наш живот и секој треба да знае како да ги формулира проблемите и да ги изрази решенијата за нив така што ќе може да бидат спроведени од компјутер. На овој курс студентите ќе научат различни аспекти на информатичкото размислување и пристапи за нивно подучување во основното и средното образование. Тие ќе научат јазик заснован на блокови и модерни пристапи дизајнирани да го олеснат учењето програмирање.",
	"Инженерска математика": "Предметот опфаќа методи за нумеричкото решавање на повеќе математички проблеми, како и примена на некои\nпозначајни математички трансформации во инженерството.",
	"Интернет програмирање на клиентска страна": "Целта на курсот е да овозможи запознавање на студентите со основните на програмирањето на интернет клиентската страна. Во таа насока студентите ќе бидат запознаени со дел од програмските јазици и технологиите за пишување програми што се извршуваат на клиентската страна. По завршување на курсот се очекува студентот да може да развива интерактивни веб-страници со користење на програмски јазици наменети за програмирање на клиентската страна.",
	"Интернет технологии": "Познавање на механизмите кај HTTP протоколот. Запознавање со платформи за развој на интернет апликации.\nКреирање и развој на веб апликции. Креирање и користење на веб сервиси.",
	"Компјутерска графика": "Целта на предметот е запознавање на студентите со теориските основи и концепти на 2D и 3D компјутерска графика, геометриското моделирање, трансформациите, рендерирањето и генерирањето криви и површини со помош на сплајнови. Практичната имплементација на алгоритмите ќе се реализира со помош на OPEN GL. По завршување на курсот се очекува студентот да демонстрира познавање на теориските основи и концепти на 2Д и 3Д компјутерската графика, да користи OpenGL библиотека и графички софтверски пакети за практична реализација на проблеми од компјутерската графика.",
	"Компјутерски мрежи": "Вовед во основните концепти на компјутерските мрежи. Студентот ќе се здобие со знаења поврзани со мрежната архитектура, мрежните протоколи и дизајн на мрежи. Студентот ќе се запознае со главните компоненти и апликации на TCP/IP свитата од протоколи.",
	"Компјутерски мрежи и безбедност": "Вовед во основните концепти на компјутерските мрежи и безбедноста. Студентот ќе се здобие со знаења поврзани со мрежната архитектура, мрежните протоколи и работата на мрежите, како и главните поими од мрежната безбедност. Студентот ќе се запознае со главните компоненти и апликации на TCP/IP свитата од протоколи.",
	"Концепти на информатичко општество": "Целта на курсот е да се запознаат студентите со теориите и пристапите кои ја анализираат улогата на информатичката технологија, медиумите и знаењето во модерното општество. По завршување на модулот студентите треба да бидат способни да:\n1.\tСистематски и критично дискутираат, евалуираат и ги анализираат главните теми, принципи, концепти и теории на информатичкото општество\n2.\tПрименуваат различни концепти од информатичкото општество\n3.\tПокажат разбирање за важноста на информатичката технологја и знаењето во модерното општество",
	"Медиуми и комуникации": "По завршувањето на предметот се очекува студентот да ги разбира основните\nпоими од комуникатологијата како наука, како и да има продлабочено знаење во примена на постоечките техники и\nсознанија за подобрување за комуникацијата помеѓу чинителите на комуникацијата. Посебен осврт ќе биден даден на комуникацијата преку новите медиуми и начинот на кој новите медиуми влијаат во различни општествени сфери. Студентите ќе бидат запознаени со основните принципи за испитување на јавно мислење и користење на новите медиуми (со посебен фокус на социјалните мрежи) за градење и промовирање на бренд (личен или корпоративен).",
	"Мултимедијални технологии": "Целта на предметот е студентот да се запознае со основите на различните медии: аудио, графика, видео и анимации и да ги сфати различните својства на секоја од нив. Студентот треба да ги запознае различните формати и да се оспособи за користење за различни апликации за креирање на мултимедијални содржини. Како повисока цел, студентот треба да може да развие мал мултимедијален производ со примена на изучените техники и методи.",
	"Напредно програмирање": "Да се воведат студентите во парадигмата на генеричкото програмирање. Да се запознаат со апстрактни податочни типови,\nкреирање на темплејт класи и функции. Да развијат вештини за употреба на колекции на податоци (вектори, редови, листи,\nмножества и речници). На крај се очекува студентите да можат да ги аплицираат концептите на шаблони за објектно-\nориентиран развој на софтвер при моделирање на некој специфициран проблем во робусна објектно-ориентирана програма.\nСтудентите ќе бидат запознаени со техниките за развивање на софтвер во интегрирана развојна околина.",
	"Квантно пресметување": "Студентот ќе биде оспособен за теоретска и практична работа со квантни кола за пресметки базирани на квантни бити (кјубити). Преку содржината на овој предмет, студентот ќе се стекне со знаења за квантни технологии, квантни состојби, квантни протоколи преку работа со квантни кола со еден, два и повеќе кјубити, реверзибилност во квантни кола, суперпозиција и телепортација, како и најразлични квантни кола за решавање на конкретни проблеми. Преку практичната работа, студентот ќе се запознае со Qiskit апликацијата за креирање и симулација на квантни кола.",
	"Оперативни системи": "Студентот ќе биде воведен во основните градбени блокови на модерните оперативни системи преку нивна конкретна реализација во Windows и UNIX-like системите.",
	"Основи на комуникациски системи": "Студентите ќе се запознаат со основните концепти за анализа на реалните сигнали и системи, со посебен фокус на анализата на комуникациски сигнали и нивниот пренос низ медиум, типовите на модулација и влијанието на шумот врз модулациските техники. Дополнително студентите ќе се здобијат со познавање од софтверски дефинирано радио, современите комуникациски системи и нивниот тековен развој.",
	"Основи на теоријата на информации": "Студентите ќе бидат запознати со основите на теорија на веројатност, а потоа и основните поими од теорија на информации и нејзината примена во реални комуникациски системи.",
	"Софтверско инженерство": "Целта на предметот е запознање со: методологиите за дизајн и имплементација на софтверски системи преку анализа на барањата, развој и анализа на дизајнот, имплементацијата, интеграцијата и тестирањето на софтверот; анализа на проблем за развој на софтвер, дизајнирање на модуларна структура на решението која го решава проблемот и анализа и евалуација на алтернативи; имплементација на ефикасни и исправни модули, нивна  интеграција и тестирање, планирање и водење на софтверските проекти.",
	"Теорија на информации со дигитални комуникации": "Студентите ќе бидат запознаени со квантитативната теорија на информации и нејзината примена во надежни и ефикасни комуникациски системи. Дополнително ќе бидат запознаени со математичкиот модел на комунникацискиот систем.",
	"Управување со техничка поддршка": "По завршувањето на курсот се очекува студентот да ги разбира методите и системите за решавање на ИТ проблемите преку обезбедување на квалитетна техничка поддршка.",
	"Шаблони за дизајн на кориснички интерфејси": "Целта на предметот е да ги запознае студентите со основните проблеми и начини на решавање на истите за различните видови кориснички интерфејси и корисничка интеракција. По завршување на курсот се очекува студентот да демонстрира познавање на основните видови корисничка интеракција и принципите за нивно дизајнирање, и да може самостојно да развива интерактивни апликации со користење на програмски алатки следејќи ги научените принципи.",
	"Агентно-базирани системи": "Агентно-базираното моделирање нуди природна метафора за разбирање и објаснување на многу феномени од доменот на биолошки и социјални системи – од еволуција и ширење на епидемии до сегрегација и формирање на коалиции. Многу системи може да се моделираат како средини составени од автономни агенти кои може да комуницираат, соработуваат, преговараат, да се спротивставуваат, да се водат од сопствени интереси или делуваат алтруистички. Микро-однесувањето на агенти водени од едноставни правила може да предизвика нови квалитети и комплексни појави во макро размери. Целта на предметот е запознавање на студентот со агентската парадигма за репрезентација и моделирање на системи од различни домени (пр. игри, роботи, однесување на социјални групи). По завршување на курсот се очекува студентот да има способност да дизајнира, моделира и реализира или симулира едно-агентен или повеќе-агентен систем.",
	"Администрација на мрежи": "По завршувањето на курсот се очекува студентот да ги разбира проблемите на администрацијата со мрежи и да знае\nда ги применува на методите и алатките за администрација со комуникациски мрежи.",
	"Администрација на системи": "Системската администрација претставува комплексен процес на оперативно управување со системските и софтверските компоненти кај компјутерските системи, се со цел да се обезбеди безбедни, надежни и достапни сервиси и услуги на корисниците. Организацијата на процесот на системска администрација е повеќестран и вклучува активности поврзани со управување со оперативни системи, мрежни сервиси како и на апликативни и други серверски системи.",
	"Бази на податоци": "Запознавање на студентот со основните концепти за работа со бази на податоци, начините на нивно моделирање и имплементирање, како и работа со прашалните јазици. Студентот ќе биде способен да моделира бази на податоци преку семантичко и релациско моделирање и процес на нормализација, ќе знае практично да го применува SQL стандардот за креирање, одржување и манипулација на релациските бази на податоци. Студентот ќе има познавање за основните концепти на конкурентно работење и трансакции.",
	"Вградливи микропроцесорски системи": "Студентите ќе се стекнат со разбирање на хардверот, софтверот и состемскиот дизајн на вградените системи. Тие ќе ја разберат важноста на интеракцијата меѓу хардверот и софтверот и поврзувањата со сензори и актуатори. Ќе ги стекнат основите на програмирање на вградени системи. Студентите ќе бидат способни да ги дефинираат архитектуралните барања, вклучувајќи го и хардверот и софтверот потребен за да се изгради модерен вграден систем.",
	"Веб програмирање": "Развој на веб комплетни веб апликации со користење на MVC шаблонот за развој. Студентите ќе научат да развиваат веб апликации и веб сервиси, да се поврзуваат и да користат бази на податоци. Да развиваат безбедносни механизми кај веб апликациите и да тестираат веб апликации",
	"Визуелизација": "Предметот треба да овозможи запознавање на студентите со концептот на вузуелизација на податоци, избор на\nтехники и алгоритми за визуелизација на различни податочни множества, и нивна програмска реализација. По\nзавршување на курсот се очекува студентот да демонстрира познавање на концептот на визуелизација на\nподатоци, да знае да избере и да реализира алгоритми за визуелизација на различни видови податоци\nпрограмски и со користење на алатки за визуелизација.",
	"Виртуелизација": "Запознавање со виртуелизацијата како парадигма на креирање на виртуелни компјутерски системи преку софтверска виртуелизација на харверските компоненти. Обработка на различните аспекти на виртуелизацијата, технологиите и техниките вклучени во процесот, како и придобивките и губитоците кои се појавуваат во процесот на виртуелизација.",
	"Вовед во мрежна наука": "Запознавање со основните концепти од мрежна наука и нивна примена на реални податоци. Оспособување на студентите за анализа на својствата и динамичките процеси во реалните комплексни мрежи и нивно моделирање и визуелизација. Изучување на основните методи за октривање на заедници, оценка на робустноста, оптимизација, податочно рударење и предвидување во комплексни мрежи.",
	"Вовед во науката за податоци": "Запознавање со основите за науката базирана на податоци. Студентите ќе се запознаат со процесот и методологијата при работа со податоци, почнувајќи од идентификацијата на проблемите, преку собирање на податоци, а потоа и нивна обработка. Студентите ќе ги научат основните техники за обработка на податоците и идентификување на шаблони во нив, како и начините на визуелизација и интерпретација на добиените резултати.",
	"Географски информациски системи": "Создавање и управување со просторни (Географски) информациони систем.",
	"Дигитална форензика": "По завршување на курсот студентите ќе се стекнат со знаење за принципите и техниките потребни за една дигитална форензичка истрага. Студентите ќе се стекнат и со практично искуство за работа со различни форензички алатки за различни оперативни системи.",
	"Дигитални библиотеки": "Запознавање на студенти со актуелните елементи од областа дигитални библиотеки (ДБ): основи и архитектури на дигитални библиотеки, технологии, управување, организација и развој на дигитални ресурси, презентација на знаење и негово откривање (прибирање на информации), мета-податоци, шеми и стандарди и релевантни интелектуални права. Во зависноста од тековниот интерес студентите ќе се запознаат со конкретен апликативен софтвер за дигитална библиотека и со практики во работењето како и евалуација на истите. По завршување на курсот се очекува студентот да демонстрира знаење за основни елементи на ДБ, технологии за развој и изградба на ДБ, начини на примена, управување и организација на ДБ",
	"Дизајн и архитектура на софтвер": "Целта на курсот е студентите да ги научат главните концепти на објектно ориентирана анализа и дизајн. Да се запознаат со техниките на рефакторирање, шаблоните за дизајн и различните архитектури на софтвер. По завршувањето на курсот кандидатите ќе можат да ги идентификуваат ограничувањата и проценат квалитетите на софтверските системи. За конкретна софтверска спецификација ќе можат да ја проценат нејзината комплетност и\nконзистентност, како и да дизајнираат софтверска архитектура во согласност со дадените барања.",
	"Дизајн на интеракцијата човек-компјутер": "Целта на предметот е да ги запознае студентите со основните принципи за дизајнирање на компјутерски системи што вклучуваат интеракција човек-компјутер. За таа цел студентите ќе бидат запознаени со процесот на дизајнирање на интерактивни системи, фазите за дизајнирање (собирање и анализа на барања, креирање на прототипови, имлементација и тестирање на употребливост). По завршување на курсот се очекува студентот да демонстрира познавање на процесот и чекорите за дизајнирање на системи што вклучуваат интеракција човек-компјутер и да може да самостојно или во тим да реализира едноставен проект за дизајнирање на интерактивни системи.",
	"Дизајн на образовен софтвер": "По успешното завршување на овој предмет, студентот ќе биде во состојба да ги: разбере принципите (педагошки, когнитивни, инженерски) кои треба да се искористат при дизај на образовен софтвер, местото и примената на различните типови на образовен софтвер во образованието, начинот на кој образовниот софтвер помага да се остварат одередени педагошко-едукативни цели, како и основните принципи за користење на образовен софтвер без притоа тој да ја наруши дидактиката на образовниот процес.",
	"Електронска и мобилна трговија": "Студентот со завршување ќе се стекне со вештини за развој на апликации за е-трговија и м-трговија. Ќе се запознаат со платформите за е-трговија и ќе научат да ги користат и употребуваат истите за градба на електронски продавници.",
	"Интегрирани системи": "По завршување на курсот се очекува студентите да се оспособени за  дизајн, избор, имплементација и менаџмент на ентерпрајз IT решенија.  Да бидат способни за работа во  корпоративна средина при имплементација и одржување со надградба на ентерпрајз IT решенија. Да бидат способни да развиваат стратегии за технолошки архитектури на комплексни софтверски системи кои опслужуваат обемни податоци, многу корисници и широк спектар деловно процеси.",
	"Информациска безбедност": "Изучување на поими поврзани со информациската безбедност; постапки и механизми за заштита кај компјутерските системи од\nбезбедносен аспект; методи што се применуваат за подигање на нивото на безбедност во однос на неовластен пристап.",
	"Инфраструктурно програмирање": "Студентот ќе се здобие со знаење за лесно и ефикасно менаџирање на IT системи, управување со традиционалните\nподаточни центри, приватни и јавни облаци и клиентските компјутери и уреди. Студентот ќе може да се запознае и со\nплатформи за менаџирање на повеќе хипервизори, физички ресурси и апликации.",
	"Компјутерска електроника": "Запознавање со фундаменталните типови на електронски елементи, принципот на работа, и нивните теоретски\nмодели. Анализа и дизајн на логички кола и засилувачи..",
	"Компјутерска етика": "Способност да се согледаат клучните културни, општествени, правни и етички аспекти на ИКТ, влијанието на ИКТ, значењето и професионалните одговорности на ИКТ професионалците; Способност критички да се согледаат и дискутираат потенцијалните\nризици што со себе ги носи ИКТ, вклучувајќи ги и последиците од нејзиниот развој врз развојот на човештвото; Стекнување информации за националните и меѓународните закони за спречување и заштита од компјутерскиот криминал.",
	"Компјутерски звук, музика и говор": "Да се стекнат со знаење на клучни прашања поврзани со анализата и генерирањето на звуци, музика и говор.",
	"Континуирана интеграција и испорака": "Запознавање со основните концепти на развој и операции (DevOps) преку континуирана интеграција, тестирање, испорака и распоредување на софтверски решенија и системи. Осознавање на различните перспективи на развојниот (Dev) и оперативниот (Ops) дел од животниот циклус на еден систем. Оспособување на студентите за употреба на алатки за автоматизација на процесите за интеграција, тестирање, испорака и распоредување. Запознавање со предизвиците и најдобрите практики за менаџирање со софтверски изданија и конфигурации.",
	"Криптографија": "Запознавање со основните криптографски принципи и методи; изучување на основните крипто-\nдизајни; практично користење на изучените криптографски алгоритми.",
	"Линеарна алгебра и примени": "Запознавање со концептите и методите на линеарната алгебра и како истите да се користат за рамислување и решавање на проблеми кои произлегуваат од компјутерските науки",
	"Машинско учење": "Целта на курсот е студентите да се запознаат со основите на модерните техники од областа на машинско учење. По завршувањето на курсот кандидатите: ќе имаат продлабочени знаења за напредните технологии и методи за машинско учење; ќе можат да разберат, анализираат и формулираат генерални проблеми од областа на машинско учење; ќе можат успешно да применат алгоритми за машинско учење при решавање на реални проблеми; ќе можат да конципираат, анализираат, реализираат и проценат перформанси на систем за машинско учење.",
	"Мерење и анализа на сообраќај": "За инженер кој работи со мрежни технологии е корисно да има познавања од мерење, анализа и моделирање на сообраќајот заради поквалитетно дизајнирање на мрежите како и подобро користење на нивните перформанси. Со овој курс студентите ќе се запознаат со основите на инженерството на комуникациски сообраќај, како и различни техники за анализа, мерење, карактеризација, класификација и предвидување на интернет сообраќај. Исто така ќе биде прикажано како слични анализи може да прават и за други типови на сообраќај.",
	"Сајбер безбедност": "Целта на овој курсот е да се покријат принципите за безбедноста кај компјутерските системи и мрежи, при што\nстудентот ќе се запознае со различни техники за напад и одбрана.",
	"Мултимедиски мрежи": "Целите на предметот се да ги запознае студентите со карактеристиките на мултимедиските содржини кои се важни за далечински пренос, механизмите за дистрибуција на мултимедиски содржини од гледна точка на мрежните протоколи, пречките во мрежите при пренос, како и начините како да се подобори квалитетот на достава. Исто така, студентите ќе се запонзаат со различни платформи и архитектури за достава на мултимедиски содржини. Студентите ќе се оспособат да ги анализираат мулитмедиските содржини, да ги прилагодат и постават на сервери кои ќе обезбедат нивна достава во различни мрежни услови.",
	"Мултимедиски системи": "Запознавање на студентот со основните концепти за работа со мултимедиските податоци, начините на нивно моделирање и имплементирање и манипулација со истите. Студентот ќе биде способен да моделира мултимедиски податоци, ќе знае практично да го применува содржински-базираното пребарување на мултимедиските податоци, и ќе се здобие со воведни знаења за креирање на апликации базирани на  мултимедиските содржини.",
	"Напреден веб дизајн": "Целта на наставната програма е студентите да се запознаат со напредните технологии во областа на веб дизајнот и развојот на модерни динамички веб апликации. По завршување на предметот, студентите ќе имаат преглед на најновите технички достигнувања во областа на веб дизајнот и ќе бидат способни да ги користат истите во изработкa на практични проекти",
	"Основи на роботиката": "По завршувањето на овој предмет, студентот се очекува да има познавања од принципите на развој на роботи и системи кои вклучуваат сензори и ефектори. Студентите ќе се запознаат со начините на програмирање роботи кои овозможуваат нивно управување. Студентите ќе се запознаат со примената на роботите во индустријата и општеството",
	"Паралелно и дистрибуирано процесирање": "Цел на предметот е студентите да ги совладаат методите на паралелно и дистрибуирано процесирање, можностите за паралелизација на секвенцијална програма, дистрибуирано процесирање на голем број на податоци и проблемите со кои треба да се справат во тој процес",
	"Паралелно програмирање": "Истражување на алгоритмите и техниките за програмирање на најновите паралелни платформи со споделена меморија и со\nдистрибуирана меморија. Студентот ќе се запознае со теоретските и практичните (програмските) компоненти.",
	"Персонализирано учење": "Персонализираното учење е современ начин на одржување на наставата која ги пресретнува индивудуалните потреби на секој ученик. Студентите се оспособуваат да ги препознаат спецификите на совладување на знаењата кај учениците од основните и средните училишта. Студентите ќе осознаат како да се справат со предизвикот за вклучување на персонализираното учење во рамки на класичната училница и како да се поттикнува усвојувањето на нови знаења кај различните стилови на учење.",
	"Податочно рударење": "Запознавање со методи за идентификација на валидни, нови, корисни и разбирливи шеми во податоци и откривања на нови знаења. Претпроцесирање на податоците. Вовед во предиктивни модели од податоците: класификација, регресијa. Откривање на кластери. Совладување на техники за собирање на податоци, нивно траксформирање во облик погоден за интерно користење и нивно зачувување.",
	"Процесирање на сигналите": "Познавањето на основите и техниките на дигиталното процесирање на сигнали е важно за секој инженер кој работи на апликации каде што има процесирање на сигнали. Со курсот студентите се воведуваат во теоретските основи дигитално процесирање на сигнали кои вклучуваат дискретизација, Фуриеова и z – трансформација. Студентите ќе стекнат и познавања од основните алатки како што се дигиталните IIR и FIR филтри. Во курсот ќе бидат дадени и основите на теоријата на управување. Преку бројните примери и вежби студентите ќе научат и практично да користат готови алатки за процесирање на сигнали.",
	"Вештачка интелигенција за игри": "Студентите ќе ги разберат тековните проблеми и техники во академската и индустриската Вештачка интелигенција (ВИ) за игри, во исто време стекнувајќи практично искуство во работењето со разни готови алатки за техниките на ВИ применувани во индустријата за игри денес. Ќе бидат оспособени за подобро да ја разберат врската помеѓу ВИ за игрите и естетиката, наративот и играчкото искуство, на тој начин обезбедувајќи зголемена вклученост и задоволство на играчите.",
	"Психологија на училишна возраст": "Целта на предметот е студентите да се запознаат со елементите од психологијата и психологијата на учењето",
	"Работа со надарени ученици": "Студентите се оспособуваат да станат професори кои успешно ќе идентификуваат ученици кои имаат потенцијал да го прошират знаењето од областа на информатиката и решавање задачи од алгоритамска природа, со употреба на напредни структури и алгоритми коишто не се опфатени со редовната програма. Идните наставници се оспособуваат да пренесат основно знаење за напредната програма на учениците и да ги насочат во процесот на учество на национални и интернационални натпревари по информатика.",
	"Сервисно ориентирани архитектури": "Предметот сервисно-ориентирани архитектури има за цел да ги запознае студентите со организација, дизајн и развој на на дистрибуираните системи базирани на сервиси. Сервисно-ориентираните архитектури опфаќа теми од софтверско и системско инженерство. Од аспект на софтверско инженерство студентите ќе се запознаат со процесот на анализа и дизајн при развој на сервисно-ориентирани апликации, како и со организацијата на процесот на развој на софвер погодни за сервисно-ориентирани системи. Во поглед на системско инженерство, предметот ќе го покрие целосниот екосистем на сервисно-ориентирана и микро-сервисно ориентирана архитектура, нејзините компоненти, поврзаност, соработка и координација.",
	"Современи компјутерски архитектури": "Разбирање на концептите и имплементациите на современите процесори. Анализа на современите процесори. Студентот ќе биде оспособен да дизјанира  современи процесори и процесирачки елементи",
	"Софтверски дефинирана безбедност": "Разбирање и примена на клучните концепти од развој на безбеден софтвер во поглед на податоци, автентикација, авторизација и безбедни веб апликации.",
	"Софтверски квалитет и тестирање": "Целата на курсот е запознавање на студентите со потребата од тестирање на софтвер, различните техники на моделирање на софтверот и искористување на тие модели за тестирање, како и практични работа на тестирање, валидација и верификација на софтвер.",
	"Автоматизирање на процеси во машинско учење": "Запознање со основните чекори за поставување на модели од машинско учење во продукција, оптимизација на piplelines во ML, дизајн на целосен животен циклус на ML моделите, CI/CD кај ML, упраување со ML код, следење на моделите во продукција, менаџирање со модели.",
	"Учење на далечина": "Студентите ќе се запознаат со концептот за далечинско учење, со технологиите кои го поддржуваат далечинското учење, како\nи со придобивките со неговото користење. Со слушање на овој курс студентите ќе се оспособат да планираат и дизајнираат,\nда научат како се имплементираат системи за далечинско учење, ќе ја осознаат разликата помеѓу курсевите кај учење на\nдалечина и курсевите во класичната настава, улогата на инструкторот и ученикот во овој систем, како и сегашноста и\nиднината на системите за далечинско учење",
	"Основи на теоријата на компјутерските науки": "На овој курс ќе стекнете основно разбирање за класичните модели кои се користат во основата на компјутерските науки за анализа на пресметковните процеси, вклучувајќи конечни автомати, граматики и Тјурингови машини. Овие  модели може да се користат за да се одговори на прашања како што се кои проблеми може да се решат со компјутер и дали има некои проблеми кои се суштински потешки за решавање од другите.",
	"Автономна роботика": "По завршувањето на овој предмет, студентот се очекува да има продлабочено знаење за развој на автономни роботски системи (автономни возила, автономни летала и сл.) со користење на веројатностните пристапи во роботиката.",
	"Администрација на бази податоци": "Предметот ќе се фокусира на state-of-the-art технологиите поврзани со имплементација на базите на податоци. Технологиите и техниките кои се користат за имплементација на базите на податоци ќе бидат обработени како од кориснички, така и од системски аспект.\nОд аспект на системско инжинерство, предметот ќе навлезе во концептите и алгоритмите за: процесирање на трансакции, контрола на истовремено извршување, репрезентација на лог и метадата, безбедносни политики кај базите, техники за репликација и дистрибуција, бекап и реставрација.",
	"Анализа и дизајн на ИС": "Запознавање на студенти со актуелните техники за анализа и дизајн на информациските системи (ИС). Навлегување во студија на случај на развој на ИС со користење на актуелни методологии. Оспособување за практична анализа на кориснички побарувања и креирање ефективни модели во сите фази  развој на еден ИС, со нагласок на фазите на анализа и дизајн. По завршување на курсот се очекува студентот да демонстрира знаење за користење на современи пристапи во процесот на анализа и дизајн на информациските системи.",
	"Биолошки инспирирано пресметување": "Целта на овој курс е запознавање на студентите со алгоритми кои се инспирирани од феномени кои се појавуваат во природата и примена на истите за решавање на проблеми од оптимизација, дизајн и учење. Фокусот ќе биде поставен врз абстракцијата на алгоритмите од воочените феномени, анализа на нивниот резултат како и нивна споредба. Во текот на курсот ќе се посвети внимание на конкретни примени на споменатите алгоритми. По завршувањето на курсот се очекува студентите да се здобијат со:\n-\tЗнаење за природните феномени кои се инспирација за дискутираните алгоритми\n-\tРазбирање за силните и слабите страни на алгоритмите\n-\tСпособност за идентификување на соодветноста на алгоритмите и нивна примена во проблеми од оптимизација, дизајн и учење",
	"Блоковски вериги и криптовалути": "Целта на овој курс е да овозможи на слушателите да разберат како фунцкционираат крипто валутите,  и идејата, технологиите и организациите кои ги поддржуваат или произлегуваат од нив.",
	"Веб базирани системи": "Запознавање и користење на технологиите на семантички веб, поврзани податоци и графови на знаење. Студентите ќе научат да развиваат интелигентни апликации базирани на графови на знаење и да пронаоѓаат и користат отворени податочни множества.",
	"Веб пребарувачки системи": "Запознавање со концепти за развој на веб пребарувачките системи. Разбирање на начините на обработување на прашањата и множеството на документи низ кои се пребарува, како и начини за автоматско собирање податоци од веб. По завршувањето на курсот се очекува студентот да демонстрира познавање на методи за процесирање на прашања, репрезентација на документите и нивно индексирање и класификацирање, да демонстрира познавање на методи за пребарување и индексирање на слики и да може самостојно да развива алгоритми за пребарување со користење на програмски алатки.",
	"Виртуелна реалност": "Предметот треба да овозможи запознавање на студентите со концептот на виртуелна реалност, различните\nвидови виртуелни околини, влезно-излезните уреди, како и основни програмерски техники за дизајнирање и\nразвој на виртуелни околини. По завршување на курсот се очекува студентот да го разбира концептот на\nвиртуелната реалност, да биде во можност да ги опише карактеристиките на различните видови виртуелни\nоколини и да има основни познавања за дизајнирање и развој на виртуелни светови.",
	"Вовед во анализа на временските серии": "Запознавање на студентите со анализа на произволни временски серии со традиционални статистички методи, како и со методи базирани на длабоко учење. Курсот дава вовед во типовите на временски серии, покрива стационарни процеси, ARMA модели, ARIMA и сезонални ARIMA модели, временско-просторни методи. Со знаењето стекнато на курсот студентите ќе може да анализираат временски серии од разновидни извори, податочни текови (data streams), IoT и да откриваат трендови и аномалии, да предвидуваат идни појави, како и да ги користат за препознавање на разновидни настани кои се опишани со временски серии.",
	"Вовед во биоинформатиката": "Студентите да се запознаат со областите и проблемите кои ги покрива биоинформатиката, да\nбидат во можност да вршат генска и протеинска секвенцна анализа, да користат биолошки бази\nподатоци, да ги запознаат пресметковните методи за решавање проблеми во молекуларната\nбиологија.",
	"Вовед во когнитивни науки": "Целта е да се разбере како работи човечкиот мозок. Студентите ќе се запознаат со теоретските и емпириските погледи кои ја дефинираат когнитивната наука. Ќе се запознаат со истражувањата за природата на менталните процеси како перцепцијата, мислењето, меморијата, фантазијата, вниманието, јазикот, интелигенцијата, донесувањето одлуки и решавањето проблеми. Студентите ќе научат кои се алатките превземени од експерименталната психологија, наука на развојот, комјутерската наука, лингвистика, визуализацијата, филозофијата, антропологијата, бихевиоризмот, неврологијата. Курсот ќе ги поврзе сите овие пристапи кои се поврзуваат во когнитивната наука.",
	"Вовед во паметни градови": "Да го запознае студентот со главните концепти, теми и трендови на паметните и одржливите градови, улогата на информациите во дизајнот на мрежните ресурси и влијанието врз урбаниот дизајн, развојот и урбаното живеење.",
	"Вовед во препознавање на облици": "Целта на курсот е студентите да ги научат главните концепти на методите и техниките кои се применуваат за\nпрепознавање на облици.По завршувањето на курсот кандидатитеќе бидат оспособени за дизајнирање,\nреализирање и имплементација на системи за автоматско препознавање на облици, проценка на нивните\nперформанси и нивна оптимизација.",
	"Дигитална постпродукција": "По завршување на курсот се очекува студентите да се оспособени за основни методи за дигитална постпродукција, дигитално композитирање, работа со секвенци од слики, интеграција на дигитални објекти во слики и следење и спарување на движења од различни извори",
	"Дизајн на компјутерски мрежи": "Целта на овој курсот е да го оспособи студентот да работи со големи компјутерски мрежи и да обезбеди колаборативна работа на различни административни региони, како и да дизајнира различни типови компјутерски мрежи според потребите на крајните корисници.",
	"Дипломска работа": "Во рамките на дипломската работа, студентот се стекнува со вештина за дефинирање на проблем, и примена на стекнатото знаење на факултетот за дизајн и имплементација на решение на дадениот проблем. Дополнително, студентот успешно идентификува потреба од дополнителни знаења за решавање на проблемот. Исто така студнетот ги документира и презентира резултатите од дипломската работа",
	"Дистрибуирани системи": "Предметот има за цел запознавање со развојот на middleware системите. Предмеот ги покрива принципите врз кои се изградени дистрибуираните системи, пред се комуникациите, процесирањето, именување, конзистентност и репликација, справувње со дефекти и безбедност. Овие принципи се понатаму обработени во нивната примена кај дистрибуираните веб базирани системи, дистрибуираните објектно базирани системи, дистрибуираните датотечни системи и дистрибуираните коориднациски системи.",
	"Дистрибуирано складирање на податоци": "Се поголемата важност и големиот обем на податоците побаруваат соодветни техники и технологии за нивно безбедно, достапно, надежно и скалабилно складирање. Се почестите приоди за складирање на податоци се ориентираат кон дистрибуирани решенија чии имплементации вклучуваат најразлични архитектури и модели со што се добиваат различни придобивки, специфични за секоја имплемнетација. Предметот има за цел да ги обработи техниките на хардверско, мрежно и софтвеско ниво за обезбедување на дистрибуирано складирање на податоците.",
	"Етичко хакирање": "Студентот ќе ги запознае основните концепти, техники и алатки кои се користат во полето на безбедност на системи. Со преземање на улогата на \"напаѓач\" студентот ќе се стекне со знаење за повеќето сигурносни слабости во неговата околина и начин како да се заштити од нив.",
	"ИКТ за развој": "Целта на курсот е да ги разгледа основите принципи и најдобри практики за користењето на технологијата за развој на човештвото. Да се разбере концептот на одржлив развој кој ги го вклучува влијанието врз природата, луѓето, општеството и управувањето. Разбирање на можностите за примена на нови ИКТ технологии за општо добро.",
	"Имплементација на софтверски системи со слободен и отворен код": "По завршување на курсот се очекува студентите да се оспособени за продуктивно учество во поголеми софтверски\nтимови кои работат употребувајќи технологии со слободен и отворен код. Да бидат способни за работа во програмски јазици со отворен код, да развиваат веб апликации на тие платформи. Да бидат способни да водат софтверски проект\nбазиран на технологии со слободен и отворен код.",
	"Иновации во ИКТ": "Разбирање на иновативноста. Стекнување на иновативни вештини. Примена на ИКТ за креирање на иновации. Креирање на\nиновации во ИКТ.",
	"Откривање знаење со длабоко учење": "По завршување на предметот, студентот ќе биде оспособен за  избор на соодветни техники за откривање и извлекување на знаење од различен вид податоци. Студентот ќе поседува познавања за напредни архитектури за длабоко учење со примена во системи за препораки, анализа на граф-структурирани податоци и мултимодална фузија на податоци.",
	"Интелигентни системи": "Целта на предметот е да го заокружи знаењето на студентите од областа на интелигентните системи, почнувајќи од претпроцесирањена податоците до валидирање на изградениот систем. Студентите ќе се оспособат да изградат интелигентен систем од почеток до крај на реални проблеми од специфичен домен, користејќи алатки за автоматизација на процесот на градење ИС.",
	"Интернет на нештата": "Студентот ќе биде запознаен со главните развојни чекори  и предизвици при дизајнирање на решенија базирани на Интернет на нештата.  Студентот ќе може да моделира, дизајнира и имплементира вакви системи во различни апликативни домени.",
	"Компјутерска анимација": "По завршување на курсот се очекува студентите да се оспособени за основни методи за продуктивно создавање на компјутерски базирани анимации, за работа во апликации за создавање анимации и можат самостојно да моделираат, текстурираат, ригуваат, осветлуваат, анимираат, рендерираат и композитираат дигитални сцени.",
	"Компјутерски поддржано производство": "Целата на курсот е запознавање на студентите со теоријата, принципите и праксата за компјутерски потпомогнато производство, основните поими за системи и модели, контрола и симулација на производни процеси.",
	"Македонски јазик": "Стекнување на знаења и компетенции за Македонскиот јазик.",
	"Машинска визија": "Да се воведат студентите во основните концепти и техники во компјутерската визија. Студентите кои успешно ќе\nго завршат курсот ќе бидат способни за дизајнирање на ефикасни системи за компјутерска визија како:\nпрепознавање на ракопис, детекција и препознавање на лица, проценка на движење, следење на луѓе и возила,\nпрепознавање на гестови, препознавање и класификација на визуелни објекти, разбирање и анализа на сцени\nитн.",
	"Менаџмент информациски системи": "По завршување на курсот студентите ќе имаат познавање од видови и примена на менаџмент информациски системи.",
	"Методика на информатиката": "Целта на предметот е оспособување на студентите да користат најсовремени техники за работа на час за да го предизвикаат интересот на учениците и истите да ги поттикнат на усвојување нови знаења за време на наставата во училницата. Студентите ќе се оспособат да спроведуваат активна настава во училницата, користејќи креативни техники според возраста на учениците и материјалот според наставниот план.",
	"Методологија на истражувањето во ИКТ": "Целта на курсот е студентите да се запознаат со основите на методологиите на истражување во ИКТ. По завршувањето на курсот кандидатите ќе имаат продлабочени знаења за методологиите на истражувања во ИКТ, ќе можат да конципираат и спроведат научно истражување, и да напишат извештај од научно истражувачката работа.",
	"Мобилни апликации": "По завршувањето на предметот се очекува студентот да има продлабочено знаење во примена на технологиите и алатките за дизајн и развој на мобилни апликации.",
	"Мобилни информациски системи": "По завршувањето на предметот се очекува студентот да има продлабочено знаење во примена на технологиите и алатките за складирање, прибирање и обработка на податоци во дистрибуирана и сеприсутна околина со користење на различни мобилни платформи.",
	"Мобилни платформи и програмирање": "Целта на предметот е студентите да се запознаат со современите мобилни платформи и да научат да програмираат и развиваат мобилни апликации. Ќе научат да се справуваат со ограничувањата од мобилните уреди и да развиваат ефикасни програми. Изработените апликации ќе научат да ги публикуваат на маркет и да го следат користењето на истите",
	"Моделирање и менаџирање на бизнис процеси": "По завршувањето на предметот се очекува студентот да ги разбира и има продлабочено знаење за типови бизнис процеси и нивна поврзаност со ИС, ќе имаат продлабочено знаење во идентификување, моделирање и мапирање разни типови бизнис процеси, ќе знаат да применат алатки и јазици за моделирање на бизнис процеси преку соодветни дијаграми, ќе имаат познавање од принципите за подобрување на тек на процеси, ќе имаат познавање од концептите за податочна размена и интероперабилност.",
	"Моделирање и симулација": "Студентот ќе се здобие со знаења за користење на техники за моделирање со цел да го евалуира однесувањето на реалните системи. Студентот ќе стекне способност за конструирање, верификација и решавање\nна модели со различни нивоа на апстракција и деталност. Ќе бидат опфатени и методи за фитување на состојбата и параметрите на моделите со реални податоци, како и предвидување на идното однесување и \"што-ако\" анализи.",
	"Модерни трендови во роботика": "Студентите ќе бидат воведени во модерните трендови во роботиката. Ќе бидат запознаени со современите техники на моделирање на околината, во која роботите стануваат секојдневие. Студентите ќе се стекнат со познавање на тековните трендови во роботиката како што се интеракција човек – робот, нанороботика, биолошки роботи, роботизирани производни процеси, роботика како асистивна технологија и други трендови",
	"Мрежна и мобилна форензика": "Студентот ќе се здобие со знаења за примена на методологии за собирање, зачувување, анализа и документација на дигитални докази пронајдени како резултат на сајбер криминал во мрежна и мобилна околина.\nСтудентот ќе знае како да анализира и интерпретира живи мрежни мобилни дигитални докази.",
	"Напредна интеракција човек компјутер": "Овој предмет ги запознава студентите со основите на комплексната интеракција која се одвива меѓу човекот и компјутерот. Студентите се запознаваат и со техниките за моделирање на корисници, проблеми, апликации и средини како и на техники за евалуација и анализа на интелигентни интефејси. Се разгледуваат принципи за градење посредници кои ги опфаќаат ограничувањата и во двете примарно афектирани групи: човекот и компјутерот. Студентите треба да научат дека корисникот е еден од главните елементи при креирање на компјутерските системи. При тоа, се дава увид во начинот за развивање на хардверот и софтверот за различни групи на корисници, како и за специфични апликациски домени. Студентите стекнуваат познавања на принципи за проектирање на кориснички интерфејси адаптибилни на околината, интелигентни кориснички интерфејси базирани на агенти и интерфејси чувствителни на контекст, како и интелигентни решенија наменети за специфични типови на кориснички групи.",
	"Напредни бази на податоци": "Запознавање на студентите со напредните концепти на релационите бази на податоци, неопходни за моделирање, креирање, управување и одржување на базите на податоци, како и за  развој на податочно интензивни информациски системи. Со тоа студентите ќе се стекант со длабоки теоретски и практични знаења од областа на базите на податоци. Исто така, студентите ќе се запознат со современите текови на развој и проширување на традиционалните системи за управување на бази на податоци, а со цел да одговорат на актуелните предизвици во развојот на информатичката теорија и практика.",
	"Web3 апликации": "Целта на овој курс е да овозможи на слушателите да разберат како фунцкционираат web3 апликациите. Ќе се надгради знаењето од блоковски вериги со апликации кои работат над паметните договори.",
	"Неструктурирани бази на податоци": "Целта на курсот е студентите да се запознаат со неструктурираните и полуструктурираните типови на податоци, нивната организација и чување, како и техниките за манипулација и обработка на истите. Исто така студентите ќе бидат запознаени и со NoSQL базите на податоци, современи бази на податоци кои не подлежат на релациониот модел, а се користат во дистрибуирани и кластер околини. Посебен акцент ќе биде ставен на практичното знаење на некоја од NoSQL базите на податоци.",
	"Обработка на природните јазици": "Целта на предметот е студентитеда се стекнат со основните теоретски и практични знаења за алгоритмите за обработка на природните јазици. Студентите ќе стекнат знаења за најновите техники на машинско учење со фокус на длабоки невронски мрежи наменети за разбирање и генерирање на текст.",
	"Операциони истражувања": "Да го запознае студентот со областа на проблеми и методи на операциони истражувања, проблеми на оптимизација на ресурси и проекти и оптимално управување, со методи и техники на линеарно и нелинеарно програмирање, теории на одлучување и игри, операциони истражувања поврзани со управувaчки информациски системи и информациски системи за подршка на одлучување и предвидување.",
	"Оптички мрежи": "Студентот ќе се стекне со основни познавања за дизајн, контрола и управување на оптички мрежи со помош на современите мрежни технологии, како и со некои тековни развои во областа.",
	"Пресметковна биологија": "",
	"Пресметување во облак": "Овој предмет ќе го оспособи студентот со основни познавања за концептот на облак и услуги во облак.",
	"Претприемништво": "Студентите ќе бидат запознаени со предизвиците со кои ќе се соочат доколку се решат да започнат сопствен бизнис. Тие ќе можат да изработат иницијално истражување на пазарот, да ги дефинираат метриките со кои ќе ја следат успеноста на својот бизнис, како и да знаат како да препознаат дали обезбедиле вредност за своите клиенти. Конечно, тие ќе бидат оспособени да се претстават пред потенцијални клиенти, партнери и инвеститори.",
	"Програмирање на видео игри": "Целта на предметот е да ги запознае студентите со процесот на програмирање на видео игри. За таа цел студентите ќе бидат запознаени со основните компоненти на една видео игра и начинот на кој истите се програмираат. По завршување на курсот се очекува кандидатот да ги разбира концептите за програмирање на видео игри и да може да реализира програмски самостојно или во тим едноставна видео игра.",
	"Програмски јазици и компајлери": "Студентите треба да го разбрерат развојот и спектарот на програмските јазици, и да го сфатат процесот на конструкција на компајлер што ќе ги надгради како програмери кои навлегле во суштината на програмските јазици.",
	"Програмски парадигми": "Целта на овој курс е запознавање на студентите со програмски парадигми различни од императивната и објектно-ориентираната, со фокус на декларативната и функционалната програмска парадигма. По завршувањето на курсот студентите треба да бидат способни да: Споредуваат различни програмски парадигми и да изберат соодветна за даден проблем, Користат логички програмски јазик за имплементација на ефикасни алгоритми,\tКористат логички програмски јазик за репрезентација и манипулација со знаење, Користат функционален програмски јазик за пишување на програми без странични ефекти, Разбираат и користат функции од прв и повисок ред, функционални затворања, мрзлива евалуација и апстракција на секвенци, Разбираат и пишуваат едноставни конкурентни програми",
	"Вовед во рударење на масивни податоци": "Студентите да се запознаат со алгоритмите и техниките на податочно рударење и машинско учење за анализа на големи податочни множества. Фокус ќе биде даден на дистрибуираните платформи како и на начинот на дефинирање и креирање на алгоритми за процесирање и анализа на многу големи податочни множества.",
	"Самостоен проект": "Целта на предметот е студентите со користење на современите алатки за  Електронско учење самостојно да ја изработат наставната програма за  предмет од основно или средно образование по  нивен избор.",
	"Системи за поддршка при одлучувањето": "Овој курс претставува вовед во примена на анализа на податоци за донесување деловни одлуки. Целта на курсот е студентите да се запознаат со методите, техниките и системите за поддршка при одлучувањето, како и анализа на одлуките. Да се запознаат со техниките за стекнување на знаење и репрезентација на знаење. По завршување на курсот студентите ќе стекнат знаење како да ги користат системите за поддршка при одлучувањето, правилно да изберат соодветен систем за поддршка при одлучувањето во даден бизнис контекст, како и да дизајнираат, развијат и менаџираат системи за поддршка при одлучувањето.",
	"Складови на податоци и аналитичка обработка": "Запознавање со oрганизацијата и манипулацијата со податоците организирани во складови на податоци, како и основните операции и алгоритми за работа со складови на податоци. Студентот ќе биде оспособен за интегрирање на оперативни бази на податоци во специјално дизајнирни модели погодни за аналитички потреби. Ова вклучува димензионо моделирање на складови на податоци, организација и манипулација со податоците сместени во складови на податоци, и изготвување на аналитички извештаи базирани на истите податоци.",
	"Софтвер за вградливи системи": "Целта на курсот е да ги оспособи студентите да креираат апликации наменети за микроконтролери како и работа со влез/излез, подетално со СТМ микроконтролерите. Студентите ќе научат да работат со Nucleo развојните плочи, да имплементираат код, да дебагираат и да управуваат со софтверска конфигурација. Исто така студентите ќе научат кога и како се користи оперативен систем во реално време.",
	"Софтверски дефинирани мрежи": "По завршувањето на курсот се очекува студентот да има познавање на архитектурата на софтверски дефинираните мрежи и мрежите со виртуелизирани мрежни функции. Да ги знае начините за софтверски пристап до мрежите,  технологиите за конвергирани мрежи и одвојување на корисничкaта од контролната рамнина, како и хардверот од софтверот.",
	"Теорија на графови и социјални мрежи": "Целта на курсот е студентите да се воведат во најважните аспекти од теоријата на графови, со подетален осврт на теоријата која е значајна за анализа на социјални мрежи.  Студентите ќе се запознаат со концептите, компонентите и организацијата на социјалните мрежи, како и технологиите за развој, интеркација и анализа на истите.",
	"Споделување и пресметување во толпа": "Целта на предметот е да ги запознае студентите со можностите на толпата да споделува и обработува податоци кои овозможуваат да се решаваат проблеми кои се сеуште комплексни за компјутерските системи, но многу едноставни за колектив со човечка интелигенција. Предметот ќе ги воведе студентите во нов дизајн на апликации и концепт на програмирање кој се заснова на недоверливо учество на голем број поединци од толпата. Во предметот ќе се разгледаат постоечки апликации и платформи за собирање на податоци и решавање на обемни задачи на барање.",
	"Тимски проект": "На студентите им се дава можност групно да изработат еден поголем проект под надзор на ментор. Се поставува акцент на тимска работа и развој на комплексен софтвер. Пожелна е пракса во фирма.",
	"Управување со ИКТ проекти": "По завршувањето на предметот се очекува студентот да ги разбира и има продлабочено знаење во примена на техниките и методите за управување со ИКТ проекти, да има продлабочено знаење во утврдување софтверски и системски барања, познавање на метриките за следење на проекти и евалуација, да има знаење да примени техники за управување со барањата на разни проектни интересни групи, знаење за примена на тенхики за анализа  на трошоци, знаење за изготвување на извештаи, познавање на практични софтверски алатки за управување со проектен циклус.",
	"Вовед во бази на податоци и SQL": "Запознавање на студентот со основните концепти за работа со бази на податоци, начините на нивно моделирање и имплементирање, како и работа со прашалните јазици. Студентот ќе знае практично да го применува SQL стандардот за креирање, одржување и манипулација на релациските бази на податоци.",
	"Примена на алгоритми и податочни структури": "Запознавање со основните податочни структури и алгоритми кои се понатаму неопходни за работа со бази на\nподатоци како и за други апликации. Студентот ќе биде оспособен за користење на структури и алгоритми\nсо линеарни листи, стебла, графови како и и индекси за пребарување. Исто така ќе биде оспособен за\nпрепознавање и користење на различните архетипи на алгоритми што се користат во практичната имплементација на многу\nсофтверски решенија.",
	"Математика 3": "Да се воведат основните концепти од веројатност и статистичка анализа со дискусија на примените во компјутерските науки. Да се оспособат студентите за успешно следење на стручните предмети во кои се применуваат елементи од теорија на веројатност и статистика.",
	"Избрани теми од математика": "Курсот претставува вовед во основните математички концепти неопходни за повисоките курсеви од информациски технологии, компјутерско и софтверско инженерство.",
	"Математика 2": "Курсот претставува вовед во основните математички концепти неопходни за повисоките курсеви од информациски технологии, компјутерско и софтверско инженерство.",
	"Тестирање на софтвер": "Целата на курсот е запознавање на студентите со воведните поими од областа на тестирање на софтвер, како потребата од тестирање на софтвер, како и практична работа на тестирање, валидација и верификација на софтвер.",
	"Сензорски системи": "Студентот ќе биде запознаен со главните предизвици при дизајн на сензорските системи.",
	"Адаптивни и интерактивни веб информациски системи": "Индустријата за персонализација и адаптација на веб е во пораст. Компаниите, институциите, универзитетите, и истражувачките лаборатории имаат потреба од бројни експерти кои ги познаваат и разбираат како функционираат адаптивните интерактивни системи, персонализацијата и социјалната навигација и интеракција за да водат развој на сопствени решенија или да нарачуваат готови решенија.\n\nОд овие причини курсот има за почетна цел да ги запознае студентите со светот на адаптивните и интерактивни веб информациски системи (АИИС). Потоа студентите ќе се стекнат знаења за различните аспекти на адаптација, персонализација, социјална навигација и интеракција во АИИС, и ќе се запознаат со во моментот најактуелните адаптивни веб технологии како готови решенија или како истражувачки демонстративни решенија кои се користат во пракса. Студентите ќе разгледуваат многу примери на модерни АИИС развиени од водечките Интернет компании како Google, Yahoo, IBM, Microsoft, Ebay, Facebook, Twitter, како и повеќе лидери на специјализирани индустрии како Netflix, Booking.com, Spotify, Hulu, Zalando.\n\nГлавна финална компетенција во овој предмет со која ќе се здобијат студентите е да го применат стекнатото знаење во реалниот свет преку анализа на потребите и исполнување на истите со постојните АИИС, критика на постојни АИИС и главните елементи од животен циклус за развој на сопствени решенија за АИИС, базирани на постојни техники и со користење на иновативни технологии за социјална интеракција и навигација, адаптација и персонализација.",
	"Спорт и здравје": "Целта на предметот спорт и спортски активности е усвојување на нови и усовршување на старите моторни знаења и вештини, подобрување на моторните и фукционалните спсособности се со цел унапредување на здравјето, задоволувањето на потребате за движење, оспообување на студентот за рационално, содржајно користење на слободното време како и подобрување на квалитетот на животот во младоста, во зрелата возраст и староста. Унапредување на социјалната комуникација. Очекувани резултати: Оспособување на студентот за самостојно спортување и физичко вежбање, запознавање со законитостите на физичката култура и правилната исхрана. Стекнување знаења за структурата, правилата, принципите на тренажниот процес и специфичностите на избраната кинезиолошка активност.",
	"Деловна пракса": "Оспособување на студентот самостојно да идентификува проблеми и нивните решенија практично да ги реализира."
}
