[
	{
		"subject": "Дигитизација",
		"type": "other",
		"category": "other",
		"content": "Проектот може да се презентира во било кое време од годината но се презентира постепено, тоа значи 3-4 онлајн консултации со професорот при правење на проектот, може групно или самостојно. Темата си ја бирате сами. Лесен предмет за висока оцена доколку го држи пак истиот професор"
	},
	{
		"subject": "Дистрибуирани системи",
		"type": "other",
		"category": "other",
		"content": "Се работи голем проект со многу администрација и фокус се дава на администрацијата."
	},
	{
		"subject": "Дистрибуирани системи",
		"type": "other",
		"category": "material",
		"content": "Се изработуваат различни системски архитектури како client-server, peer-to-peer, итн. На крај се работи и енкрипција. Се полага теорија и практично. Теорија се поважните работи од материјалот, практично се имплементираат наведените модели во Java. Има лабораториски, но не премногу. Се на се сметам дека е многу корисен предмет, не е претежок, а се имплементираат и добивате осет за некои по “апстрактни”, т.е. “lower level” проблеми."
	},
	{
		"subject": "Дистрибуирани системи",
		"type": "other",
		"category": "material",
		"content": "Дистрибуирани системи се учи мрежно програмирање во Java. Имаш теорија + задачи. За задачите прв колоквиум е TCP/UDP, а втор е Java RMI. Лаб за потпис се прикачуваат од дома, присуство на предавање/вежби не е задолжително."
	},
	{
		"subject": "Дистрибуирани системи",
		"type": "other",
		"category": "material",
		"content": "Теоријата не е тешка, се паѓаат (скоро) исти прашања секоја година(има word со прашања што се паѓаат). Проект нема. На задачи се паѓа тоа што е поминато на вежбите, ништо повеќе. Под мрежно програмирање се подразбира креирање на клиентска и серверска апликација и нивната меѓусебна комуникација со TCP/UDP протоколите. Тоа е за прв колоквиум и е доста low level. Java RMI е API од Java и е истата замисла само еден слој погоре."
	},
	{
		"subject": "Компјутерска етика",
		"type": "other",
		"category": "other",
		"content": "rangiran sum vo top 40/313 studenti na predmetov a imam 8mica sto znaci, okolu 10% od kolegite imaat ili 10 ili 9 site drugi 8mica ili nadolu."
	},
	{
		"subject": "Компјутерска етика",
		"type": "other",
		"category": "other",
		"content": "Првиот проект е да напишеш есеј од сите твои постови на групниот форум (450+-50 збора), а за втоте членови на тимот (секој треба да напише индивидуален извештај од 900+-50 збора). И вториот проф дава некои теми за групите а после раководителот на тимот ги смислува темите за сид оваа година(2021/22) се ставени и тестови за повеќе поени (5 поени секој) на две недели во термин за предавања. Доколку сакаш дополнителни поени треба да присуствуваш на предавањата (дава поени за присуство). Нема вежби, туку само предавања у два блока у недела."
	},
	{
		"subject": "Компјутерска етика",
		"type": "other",
		"category": "other",
		"content": "Predmetot moze da se zeme za 6 bez mnogu zamaranje, a za pogolema premnogu zamaranje"
	},
	{
		"subject": "Администрација на бази податоци",
		"type": "other",
		"category": "material",
		"content": "Проектно, без испит. Проектите се поврзани со напредни теми за бази на податоци, трансакциско работење и администрација во врска со се тоа."
	},
	{
		"subject": "Администрација на бази податоци",
		"type": "other",
		"category": "other",
		"content": "мала група студенти, фокусирана работа"
	},
	{
		"subject": "Мобилни платформи и програмирање",
		"type": "other",
		"category": "material",
		"content": "Андроид апликации, теоријата е ок прв колоквиум за lifecycle на мобилна апликација, втор колоквиум е безвеза, аудиториските се android app (MVVM) во java, секоја аудиториска е нова, не е како spring проект што се надоградува."
	},
	{
		"subject": "Мобилни платформи и програмирање",
		"type": "other",
		"category": "material",
		"content": "Лабараторските помагаат за учење. Убаво е да се знае kotlin - андроид програмирање. Ќе научите kotlin ако се замарате за проект."
	},
	{
		"subject": "Мобилни платформи и програмирање",
		"type": "other",
		"category": "other",
		"content": "Доколку ве интересираат андроид апликации и сакате да се замарате со проекти за да научите, земете го, корисен е. Доколку барате лесен предмет за положување, или пак предмет по кој ќе имате убава оценка, барајте друг"
	},
	{
		"subject": "Вовед во препознавање на облици",
		"type": "evaluation",
		"signature_condition": "",
		"methods": [
			{
				"note": null,
				"components": [
					{
						"category": "theory",
						"percentage": 60
					},
					{
						"category": "project",
						"percentage": 25
					},
					{
						"category": "homework",
						"percentage": 15
					}
				]
			}
		]
	},
	{
		"subject": "Вовед во препознавање на облици",
		"type": "other",
		"category": "material",
		"content": "Имате 3 домашни, се учи во глобала она од Вовед во науката за податоци и малку подетално. Линеарна, логистичка, ensembles, невронски мрежи.. Класичен испит со два колоквиума."
	},
	{
		"subject": "Вовед во препознавање на облици",
		"type": "other",
		"category": "material",
		"content": "Ништо ново не се спомнува, се е повторување од машинско учење, податочно рударство или од ВНП."
	},
	{
		"subject": "Софтвер за вградливи системи",
		"type": "other",
		"category": "material",
		"content": "Предметот е интересен и лесен за полагање, се учи од предавања и аудиториски, се е теорија и нема програмирање освен проект. Кај проектот се работи со микроконтролерот STM32h750bdk и претставува понова технологија. На интернет има малку материјали затоа што технологијата е нова, затоа ако го изберете предметот користете го официјалниот youtube канал на компанијата производител на плочката и https://controllerstech.com вебстраната, од тука можете да научите за проектот. Сите добивме повисоки оцени, така да лесен е предметот ако ве интересира роботика и микроконтролери."
	},
	{
		"subject": "Вовед во рударење на масивни податоци",
		"type": "other",
		"category": "material",
		"content": "бидејќе е менторски предавањата се chapter-и од книга во просек по 70 страни. Се учи Flink, Spark, Recommender системи. Се полага со проект, а можно е и да има некој мини-тест. Ако навистина ве интересира ова, многу нови концепти множе да научите особено работа со голем број на податоци."
	},
	{
		"subject": "Компјутерски звук, музика и говор",
		"type": "other",
		"category": "material",
		"content": "Теми поврзани со генерирање звук, позиционирање звук во простор, звучни ефекти, генерирање говор, генерирање музика со програмирање, жива свирка со код итн. Професорот е еден од авторите на првата македонска компилација на електронска музика. За повеќе информации има закажано специјални термини за консултации професорот. Се работи PureData, SuperCollider, WebAudio API. Проекти за генерирање звуци, синтисајзери, компонирање песни."
	},
	{
		"subject": "Компјутерски звук, музика и говор",
		"type": "other",
		"category": "other",
		"content": "Помала група студенти, пофокусирано работење."
	},
	{
		"subject": "Компјутерски звук, музика и говор",
		"type": "other",
		"category": "other",
		"content": "Нема испит, само проект."
	},
	{
		"subject": "Основи на роботиката",
		"type": "other",
		"category": "material",
		"content": "Предметот е интересен и лесно се положува, со комбинација од теорија (есејски прашања од презентации) и практичен дел со Arduino кодирање, цртање шеми и лабораториски задачи (вклучувајќи проект и симулации). Се нуди флексибилност во полагањето, професорот е фер, а предметот е добар вовед во роботиката, иако не се навлегува длабоко во материјалот."
	},
	{
		"subject": "Напреден веб дизајн",
		"type": "other",
		"category": "other",
		"content": "Реално предметот е добар, доколку се одлучите да го земете за да правите сопствен/тимски проект со frontend и backend технологии, бидејќи имате слободен избор за тема на проект, како и технологии (Vue, React, Angular) и си правите проект за плус поени во вашето CV. Во спротивно, многу тешко е за положување без проект."
	},
	{
		"subject": "Напреден веб дизајн",
		"type": "other",
		"category": "other",
		"content": "Теорија, практичен дел и 5 лабс. Предметов ќе ти биде полесен ако имаш положено основи на веб дизајн и интернет програмирање според мене. Предмет од 3та година."
	},
	{
		"subject": "Напреден веб дизајн",
		"type": "other",
		"category": "staff",
		"content": "Предаваат Бобан Јоксимовски, Гоце Арменски и Иван Чорбев. Сите професори и асистенти што се одговорни за предметите по веб девелопмент според мене се супер и одлично објаснуваат."
	},
	{
		"subject": "Напреден веб дизајн",
		"type": "other",
		"category": "material",
		"content": "Има неколку лабс, се учи vue.js. Има теорија и практичен дел. Предава Гоце Арменски, добар професор кој многу добро предава и објаснува. Во предавањата се учи за Canvas, SVG, CSS Preprocessors, Bootstrap, Search engine optimization и слично. Има по малце опфатено од повеќе области. Има 5 лабораториски со vue.js. Моја препорака е да имаш претходно положено барем Основи на веб дизајн и Интернет програмирање."
	},
	{
		"subject": "Напреден веб дизајн",
		"type": "other",
		"category": "material",
		"content": "Ако на прв колоквиум извадиш солидни поени на практичниот дел, можеш на вториот колоквиум да не полагаш практичен дел туку да направиш проект (како за основи на веб дизајн)."
	},
	{
		"subject": "Напреден веб дизајн",
		"type": "other",
		"category": "material",
		"content": "Дел од областите кои се покриени сметам дека се тотално непотребни особено за во областа на програмирање. Т.е. Се изучуваат некои стари технологии. Vue.js не се користи баш за работа, бидејќи преовладуваат React и Angular. На аудиториски решаваш како да направиш форма со 2 инпути и копче во Vue, на испит ти даваат да испрограмираш Game of life во Vue. True story."
	},
	{
		"subject": "Програмирање на видео игри",
		"type": "other",
		"category": "staff",
		"content": "Проф. Катарина Тројаначец, навистина добро објаснува и е достапна за прашања и/или консултации во било кое време."
	},
	{
		"subject": "Програмирање на видео игри",
		"type": "other",
		"category": "material",
		"content": "Се работи во pygame, софтвер за креирање едноставни игри преку пишување на python код. Секоја недела се изучува нова игра и имаш тест/домашна за таа игра, домашните се обично од тип, смени/додади нешто за играта да добие нова функционалност. "
	},
	{
		"subject": "Администрација на системи",
		"type": "other",
		"category": "material",
		"content": "Се изучува администрација на Linux системи. Прв колоквиум (поправено) ти е општо за Linux вовед, како функционира, systemd, потоа имаш DNS и DHCP (скоро истото како на мрежи, малце проширено). Втор колоквиум се веб сервери (Apache, Nginx), FTP, NFS и HTTP."
	},
	{
		"subject": "Администрација на системи",
		"type": "other",
		"category": "staff",
		"content": "Асистентот прилично добро објаснува практично. Има доста искуство и објаснува зошто ги прави работите што ги прави на сопствените сервери. Покажува и за Ubuntu и за CentOS."
	},
	{
		"subject": "Администрација на системи",
		"type": "other",
		"category": "other",
		"content": "Лесна 6ка, а со малку повеќе учење и повисока оцена. Испитите се повторуваат од сесија до сесија, со минимални или никакви разлики во задачите. Практичниот испит е open book (можеш и да гуглаш), и до тие 40% можеш да дојдеш и со навистина минимално знаење, со тоа што ќе ги извршуваш командите дадени во аудиториски без ништо да менуваш, и со малку гуглање да најдеш некои што ги нема. Пример задача ти е да инсталираш Apache Web Server (една-две команди се и ги има во слајдовите) и тоа ти носи 10%.  Сепак подобра варијанта ти е барем една целина да ја научиш добро и да ги извадиш сите поени за да имаш над 50, бидејќи инаку ќе мора да се вадиш на теорија."
	},
	{
		"subject": "Веб програмирање",
		"type": "evaluation",
		"signature_condition": "",
		"methods": [
			{
				"note": null,
				"components": [
					{
						"category": "practical",
						"percentage": 40
					},
					{
						"category": "theory",
						"percentage": 25
					},
					{
						"category": "labs",
						"percentage": 15
					},
					{
						"category": "project",
						"percentage": 20
					}
				]
			}
		]
	},
	{
		"subject": "Веб програмирање",
		"type": "other",
		"category": "other",
		"content": "Рок има до Март или Април и тоа е единствена шанса да се презентира. Проектот не е задолжителен."
	},
	{
		"subject": "Веб програмирање",
		"type": "other",
		"category": "other",
		"content": "Предметов е многу добар. Значи може да го рачунате како еден од најдобрите предмети на факултетов. Ако сега го започнувате третиот семестар, и првиве 2 години поминавте низ толку рандом предмети, овој предмет еден вид ќе ви ги отвори очите на поголемата слика, Работите од напредно кај се куцаат во реална апликација, базата кај оди, frontend-от кај се наоѓа, и како сите комуницираат еден со друг… Точно е дека понатаму ќе имате доста backend/frontend предмети, ама овој е мислам предмет кој не би го пропуштил. Предметот има доста голем материјал, ама речиси сите го положуваат."
	},
	{
		"subject": "Веб програмирање",
		"type": "other",
		"category": "material",
		"content": "Ако сакаш програмирање на големи проекти, што земаат недели можеби и месеци, предметот ќе ти дава feel good vibes. Се учи Java Spring кој е framework во Јава за веб-дев. Инкрементално се работи на еден проект и иста таква задача се паѓа на испит. На лабс кои се на секои 2 недели, се решава иста задача со варијација на тема- буквално можиш copy-paste од аудиториски. и лабораториските носат 15% од оценката."
	},
	{
		"subject": "Веб програмирање",
		"type": "other",
		"category": "material",
		"content": "Теорија се полага со дозволени материјали."
	},
	{
		"subject": "Веб програмирање",
		"type": "other",
		"category": "material",
		"content": "По предметот според мене се стекнува многу знаење и лесно се положува (скоро сите студенти го положуваат до крај на Јануарска сесија."
	},
	{
		"subject": "Веб програмирање",
		"type": "other",
		"category": "material",
		"content": "Предметов е 10/10 и можда еден од најкорисните на факс.."
	},
	{
		"subject": "Веб програмирање",
		"type": "other",
		"category": "staff",
		"content": "Кај Ристе доста се учи по Веб Програмирање бидејќи се труди да пренесе знаење и да соработува со студентите, знае да враќа брзо на мејлови или пак да ти среди ако ти се поклопуваат полагања со други предмети, меѓуто без разлика на професорот Веб Програмирање е еден од најкорисните предмети на факултетов."
	},
	{
		"subject": "Веб програмирање",
		"type": "other",
		"category": "other",
		"content": "Проектот годинава беше во група од 2 студенти (на некои можеби му беше дозволено и 3ца доколку е многу обемен ама не сум за ова сигурен). Можеш и сам да го правиш доколку сакаш. Може и групи од 3ца доколку е пообемен предметот."
	},
	{
		"subject": "Веб програмирање",
		"type": "other",
		"category": "other",
		"content": "Сами си бирате тема, која на консултации треба да ви ја одобрат. Треба да е се поголема тежина од аудиториските вежби, и да има плус технологии доколку групата што го избработува е повеќе од еден студент. Може доста лесно да ги добиете сите поени, а ако проектот ви е добар, може и повеќе од 20 поени да добиете. Добар предмет, доста корисен за компании во кои се работи со Spring Boot. Recommend."
	},
	{
		"subject": "Управување со техничка поддршка",
		"type": "other",
		"category": "staff",
		"content": "Кадарот се најодговорни на факултетов мислам. Тимовите за проектите сами си ги формираат студентите, па можеш да си во тим со колеги што знаеш дека навистина ќе сработат."
	},
	{
		"subject": "Управување со техничка поддршка",
		"type": "other",
		"category": "material",
		"content": "Најубавиот менаџерски предмет без сомневање сто пати да се запишам на факултетов сто пати ќе го изберам предметот. Се учат ITSM,ITIL,TMF,ODA и FitSM на предавања а на вежби се учи Канбан менаџерската методологија во Trello првите 2 вежби останатото се учи ОТРС тикетинг системот, преинтересна работа која ако знаеш што правиш дефинитивно ќе можеш да манипулираш и употребиш за секакви цели. Не се полага практично, само теорија на заокружување со radio buttons и дополнување реченици со испуштени зборови и точното да го изберите од радио буттон одговорот без multiple-choice или drop-down листи еднаш полагав извадив 8ца."
	},
	{
		"subject": "Линеарна алгебра и примени",
		"type": "other",
		"category": "staff",
		"content": "Предметот се полага најлесно на колоквиуми."
	},
	{
		"subject": "Линеарна алгебра и примени",
		"type": "other",
		"category": "material",
		"content": "Воопшто не е тешка математика. Се изучуваат линеарни равенки, системи, примена, независност, векторски простори, потпростори, бази, детерминанти итн."
	},
	{
		"subject": "Интелигентни системи",
		"type": "other",
		"category": "other",
		"content": "Теми кои беа опфатени на предметот: видови модели, класификатори, конволуциски невронски мрежи, SVM, претпроцесирање, кластерирање, дрва на одлучување, процесирање слики и звук, нешто кратко за биоинформатика и когнитивна наука. Истите теми се следеа на вежби со практични задачи (решавање на лист), а често Моника прикажуваше и интересни примери во Python. воглавно Моника не даде ништо повеќе од она што се работеше на аудиториските вежби. Има повеќе активности предметот, но одлична е организацијата и интересни се темите."
	},
	{
		"subject": "Дизајн на алгоритми",
		"type": "other",
		"category": "other",
		"content": "Разликата со АПС е тоа што немате ограничување во решавањето задачи на практичниот дел. Не е страшно оценувањеeто. Има добра книга напишано професорката Михова, за динамичко програмирање, што мислам дека треба и на АПС да се предложи."
	},
	{
		"subject": "Дизајн на алгоритми",
		"type": "other",
		"category": "other",
		"content": "Ако сте почетник во решавање на алгоритамски задачи, тешко ќе ви биде, но не и невозможно."
	},
	{
		"subject": "Компјутерска анимација",
		"type": "other",
		"category": "other",
		"content": "Предмет кој е многу интересен и лесен за сите оние кои ги интересира 3D моделирање и анимирање. Се изучува Blender, а за завршниот проект може да се работи и во Blender, Mudbox итн... Предметот го држи Бобан Јоксимовски, нема теорија, замарање со дефиниции и слични глупости, се се сведува на практична работа. Според мене, еден од подобрите предмети кои сум ги избрала, од чиста причина што се е сведено на практично учење и применување на наученото."
	},
	{
		"subject": "Криптографија",
		"type": "evaluation",
		"signature_condition": null,
		"methods": [
			{
				"note": "Условот за положување е често 50% од теорија и задачи заедно, не одделно, но може да се стави и некој мал услов на задачите.",
				"components": [
					{
						"category": "theory",
						"percentage": 45
					},
					{
						"category": "practical",
						"percentage": 45
					},
					{
						"category": "labs",
						"percentage": 10
					}
				]
			}
		]
	},
	{
		"subject": "Криптографија",
		"type": "other",
		"category": "other",
		"content": "Теоријата не е тешка не се бараат никакви математички докази, многу често прашањата е да се дефинира нешто. Откога се полага на курсес е со multiple choice прашања. Задачите на испит,колоквиуми се истите од аудиториските вежби со мали модификации."
	},
	{
		"subject": "Софтверски квалитет и тестирање",
		"type": "other",
		"category": "other",
		"content": "Интересен предмет ако сакате да научите повеќе за како се прави тестирање на апликации. Има неколку домашни кај што треба практично да се направи тоа што се учи на предавањата и вежбите - обично е пишување тестови за апликации во Јава."
	},
	{
		"subject": "Пресметување во облак",
		"type": "other",
		"category": "other",
		"content": "Од професорот Марјан Гушев: Предметот опфаќа материјал кој ви е потребен за да се стекнете со вештини како да создавате и менаџирате виртулена инстанца во облак. На почеток се изучуваат методите за виртуелизација и начинот на кој правиме дело од физичките компјутерските ресурси да се споделуваат со други корисници без да има преклопување или мешање меѓу различни корисници. Потоа се изучуваат методите како се организираат облаците, податочните центри и се друго околу пресметувањето во облак. На предавања се покажуваат концептите и објаснувата методите, а потоа на вежби конкретно се разрабоуваат одделни имплементации и се изучува како да се амдинистрираат истите."
	},
	{
		"subject": "Визуелно програмирање",
		"type": "other",
		"category": "other",
		"content": "По предметот има предавања и аудиториски, но не се полага теорија, туку само практично. Има изработка на проект(најчесто се изработуваат игри, но може да биде и нешто друго по желба) и може да се објектноизработува индивидуално или во група. Се вреднува креативност при изработка на проектот, визуелномногу повеќе од техничката совршеност само да се гледаат аудиториските. Многу интересен предмет, и доста лесен."
	},
	{
		"subject": "Електрични кола",
		"type": "other",
		"category": "other",
		"content": "Се полагаат електрични кола - нивно цртање и што се случува во нив. ве советувам да ги користите ресурсите од allaboutcircuits.com - бидејќи ако колегите од Електро не се делат од нив, а таман основите ги покриваат најубаво, зашто да не. Ако ги правите, за да си имате пошироки знаења за оние maker-ски предмет"
	},
	{
		"subject": "Основи на сајбер безбедноста",
		"type": "other",
		"category": "other",
		"content": "Интересен предмет и вовед за оние кои ги интересира сајбер безбедноста. Лесно се положува ако се следат предавањата и вежбите. Со малку повеќе труд може да се извади висока оценка. Површински се допираат многу теми на сајбер безбедноста, за студентите да имаат престава што се случува во секое поле, а потоа вие си бирате дали ќе навлегувате или не. "
	},
	{
		"subject": "Маркетинг",
		"type": "other",
		"category": "other",
		"content": "Прелесен предмет, се учи во два дена. Има база на прашања и за прв и за втор колоквиум. Одличен предмет за подобрување на вашиот просек. Ви го препорачувам доколку сакате да посветите внимание на други потешки предмети кои всушност би ви користеле во вашата кариера."
	},
	{
		"subject": "Претприемништво",
		"type": "other",
		"category": "other",
		"content": "Предобар предмет доколку навистина те интересира претприемништвото. Низ целиот семестар осмислуваш бизнис идеја, ја валидираш и спремаш pitch. Кога јас го полагав, крајната фаза (самото полагање) беше да презентираш пред некои поуспешни македонски претприемачи и pitch-увањето беше организирано во форма на натпревар. Победникот (оној кој ќе добие понуда за инвестиција и оној кој ќе биде изгласан од жирито) има оцена 10, без разлика на останатите активности во семестарот. Го предава Трајковиќ (изгуглај му историја) - што значи учиш од најдобриот во оваа област, бар во МК."
	},
	{
		"subject": "Напредни бази на податоци",
		"type": "other",
		"category": "other",
		"content": "интересни ствари се учат, индексирање, податочни коцки, query performance, sequential scanning etc."
	},
	{
		"subject": "Претприемништво",
		"type": "other",
		"category": "other",
		"content": "Лесен предмет. Се полага на 2 колоквиуми или се оди на испит. Испитот се состои од прашања на заокружување и да објасниш зошто баш тој одговор си заокружил. Има групен проект со уште 4 колеги, потребно е неделен извештај да се прави т.е да се објасни што сте работеле таа недела и точно кој што изработил. На крај треба да се брани проектот пред професори и тие ќе ги распоредат поените соодветно. "
	},
	{
		"subject": "Програмски парадигми",
		"type": "other",
		"category": "material",
		"content": "Логичко: Prolog со Кире Т. | Функционално: Clojure со Емил С."
	},
	{
		"subject": "Мобилни информациски системи",
		"type": "other",
		"category": "material",
		"content": "Се учи Flutter, се полага преку проект и лабс"
	},
	{
		"subject": "Компјутерска графика",
		"type": "evaluation",
		"signature_condition": "Домашни задачи, лабораториски вежби, квизови/тестови и проект.",
		"methods": [
			{
				"note": "nema kolokviumi",
				"components": [
					{ "category": "labs", "percentage": 10 },
					{ "category": "homework", "percentage": 20 },
					{ "category": "theory", "percentage": 30 },
					{ "category": "project", "percentage": 40 }
				]
			}
		]
	},
	{
		"subject": "Сервисно ориентирани архитектури",
		"type": "evaluation",
		"signature_condition": "Теорија, аудиториски со презентации и проект.",
		"methods": [
			{
				"note": null,
				"components": [
					{ "category": "theory", "percentage": 40 },
					{ "category": "presentation", "percentage": 40 },
					{ "category": "project", "percentage": 20 }
				]
			}
		]
	},
	{
		"subject": "Дигитални библиотеки",
		"type": "other",
		"category": "other",
		"content": "Проектот е да направите транскрипција од дадени аудио снимки. Тоа што се зборува во аудиото, вие треба да го напишете. Се даваат околу 4-5 часа аудио, ги делите на делчиња од 10-15 секунди и пишувате тоа што слушате. "
	},
	{
		"subject": "Мобилни апликации",
		"type": "other",
		"category": "other",
		"content": "За 10ка мораш да ја спремиш (потребно ќе биде САМО да ги исполнува условите за да може да се постави на маркет) апликацијата за маркет што не е така лесен процес."
	},
	{
		"subject": "Машинско учење",
		"type": "other",
		"category": "material",
		"content": "Во изминатите две години, предметот има премногу математички осврт кон областа (веројатносни модели и сл.)... има некои примери со sklearn но минимални, повеќе се обрнува внимание на математиката позади тие функции од sklearn"
	},
	{
		"subject": "Архитектура и организација на компјутери",
		"type": "other",
		"category": "material",
		"content": "Предметот е обемен и се учи како работи компјутерот, делови како рам меморија, кеш меморија. Се учи цела архитектура на mips процесор детално. Практичниот дел во прв колоквиум се задачи поврзани со перформанси додека за втор се учи асемблерско програмирање во mips околина со mars програмата."
	},
	{
		"subject": "Безжични и мобилни системи",
		"type": "other",
		"category": "other",
		"content": "Запишете го предметов само ако ве интересираат мрежи и се ориентирате кон мрежи предмет. "
	},
	{
		"subject": "Безжични и мобилни системи",
		"type": "other",
		"category": "material",
		"content": "Се изучуваат 802.11 амандманите во делот на вежби, а на предавањата се учи GSM,3G,4G,5G и многу други работи."
	},
	{
		"subject": "Вовед во биоинформатиката",
		"type": "other",
		"category": "other",
		"content": "Доколку не ве интересира клеточна биологија и барате некој лесно положлив предмет, не го зимајте. Во спротивно, на многу колеги предметов ми бил еден од најинтересните предмети на факултетов, биде тешко, ама бара умерена посветеност."
	},
	{
		"subject": "Вовед во науката за податоци",
		"type": "other",
		"category": "other",
		"content": "После предметов ако ве интересира областа, слободно може да си правите проектчиња, предметов + chatGPT и веќе сте Data Science инжинерчиња (како да не). Плус ако планирате да земете Машинско Учење следен семестар, на тој предмет не се учи Python, а ќе се бара лабсовите да се во python напишани, така да тој предмет ќе ви го направи полесен"
	},
	{
		"subject": "Вовед во науката за податоци",
		"type": "other",
		"category": "staff",
		"content": "Супер професор и асистент, минатиот семестар имавме и гостински предавачи од кои еден од нив работи во Google :), добар вовед во python."
	},
	{
		"subject": "Инженерска математика",
		"type": "other",
		"category": "material",
		"content": "Нумеричка математика, нумерички методи, нешто од диференцијални равенки, математички трансформации (фуриеви, лапласова)."
	},
	{
		"subject": "Економија за ИКТ инженери",
		"type": "other",
		"category": "material",
		"content": "Лесен предмет, се учат корисни економски концепти кои можат да се најдат во секојдневниот живот. Лесен предмет, добри професори, интересни предавања. Има бази и истите прашања се повторуваат."
	},
	{
		"subject": "Напредно програмирање",
		"type": "other",
		"category": "material",
		"content": "Повеќе е посветен предметот за како да направиш добра структура на кодот и на оптимални решенија за решавање на задачата(проблемот) или дел од задачата. Се учат и некои design patterns што се доста важни за ООП базиран развој на софтвер. Иако се учи во Java на предметов, темите што се учат можат да се поврзат со секој ООП програмски јазик. "
	},
	{
		"subject": "Напредно програмирање",
		"type": "other",
		"category": "material",
		"content": "Според мене, предметов треба да е задолжителен. Ако сакаш да научиш програмирање, не бива без напредно. Се учи функционално програмирање преку Java 8 Streams API, што е многу корисно за учење на други јазици што се базирани на функционално програмирање (Haskell, Scala). Дава основа и за други предмети, пред се за Алгоритами и Податочни Структури, што би се слушал паралелно со НП. Корисен и за интервјуа, на интервју за пракса голем дел од прашањата, и некои такви по специфични ги знаев одговорите ради предметов."
	},
	{
		"subject": "Напредно програмирање",
		"type": "other",
		"category": "material",
		"content": "Топла препорака земете го предметов. Овој предмет ќе ви даде и одлична подготовка на програмскиот јазик Јава, на факултетов многу од идните предмети се во јава."
	},
	{
		"subject": "Математика 1",
		"type": "other",
		"category": "staff",
		"content": "Предавањата слушајте ги кај проф. Д-р Весна Димитрова, IT’S A MUST!"
	},
	{
		"subject": "Веројатност и статистика",
		"type": "other",
		"category": "other",
		"content": "Корисен предмет но ќе цркнеш од учење."
	},
	{
		"subject": "Бази на податоци",
		"type": "other",
		"category": "other",
		"content": "Не можеш да се жалиш дека немаш од каде да учиш. Професорите нудат премногу ресурси помеѓу снимените предавања, вежби, предавања за повторување, книги, решени задачи, лабораториски за вежбање итн, со други зборови, ако дојде време на испит да не си спремен, that’s on you. Не е како кај некои други предмети каде мораш да копаш по интернет за да сфатиш шо се бара од тебе и да можеш да положиш."
	},
	{
		"subject": "Бази на податоци",
		"type": "other",
		"category": "other",
		"content": " На почетокот можете да одберите дали да правите лабораториски за потпис кои не носат поени и се многу едноставни и лесни или пак да правите проект кој носи 10% од оценката. Проектот се прави по фази и секоја фаза се презентира на консултации преку една недела. На крај се презентира целиот изработен проект."
	},
	{
		"subject": "Бази на податоци",
		"type": "other",
		"category": "other",
		"content": "Најмногу внимание обрнете на “Повторување и утврдување” делот преку кој се сумираат сите важни информации од лекциите а и се прикажани примери кои се слични на задачите што се паѓаат на испити и колоквиуми"
	}
]
